---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotHorz
source: html/a0a3e030-f72a-dbf6-edc9-d2f79dacba4b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotHorz Property

The Floor or Roof or Toposolid is no longer horizontal.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeFailedNotHorz { get; }
```